#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// ДЛЯ ТЕЛЕГРАМ-УВЕДОМЛЕНИЙ
	
	НужноОтправитьУведомление = Ложь;
	
	Если ЭтоНовый() Тогда
		// Если документ новый - всегда отправляем
		НужноОтправитьУведомление = Истина;
	Иначе
		// Если документ уже был, проверяем изменились ли ключевые поля.
		Если ВКМ_Специалист <> Ссылка.ВКМ_Специалист 
			ИЛИ ВКМ_ДатаПроведенияРабот <> Ссылка.ВКМ_ДатаПроведенияРабот
			ИЛИ ВКМ_ВремяНачалаРабот <> Ссылка.ВКМ_ВремяНачалаРабот Тогда
			
			НужноОтправитьУведомление = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НужноОтправитьУведомление Тогда
		
		// Формируем текст сообщения для бота
		ТекстСообщения = "Обновление заявки!" + Символы.ПС +
						 "Клиент: " + Строка(ВКМ_Клиент) + Символы.ПС +
						 "Специалист: " + Строка(ВКМ_Специалист) + Символы.ПС +
						 "Дата: " + Формат(ВКМ_ДатаПроведенияРабот, "ДЛФ=D") + Символы.ПС +
						 "Время: " + Формат(ВКМ_ВремяНачалаРабот, "ДЛФ=T") + Символы.ПС +
						 "Проблема: " + ВКМ_ОписаниеПроблемы;
						 
		// Создаем запись в справочнике уведомлений
		Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		Уведомление.ВКМ_ТекстСообщения = ТекстСообщения;
		Уведомление.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.ВидДоговора КАК ВидДоговора,
		|	Договоры.ВКМ_ДатаНачала КАК ДатаНачала,
		|	Договоры.ВКМ_ДатаОкончания КАК ДатаОкончания,
		|	Договоры.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧаса,
		|	УсловияОплаты.ВКМ_ПроцентОтРабот КАК Процент
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, ВКМ_Сотрудник = &Сотрудник) КАК
		|			УсловияОплаты
		|		ПО ИСТИНА
		|ГДЕ
		|	Договоры.Ссылка = &Договор";
	
	Запрос.УстановитьПараметр("Договор", ВКМ_Договор);
	Запрос.УстановитьПараметр("Период", Дата); // Берем срез на секунду документа
	Запрос.УстановитьПараметр("Сотрудник", ВКМ_Специалист);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	

	Если Выборка.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Неверный вид договора! Должен быть 'Абонентское обслуживание'.";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если (ЗначениеЗаполнено(Выборка.ДатаНачала) И Дата < Выборка.ДатаНачала) 
		Или (ЗначениеЗаполнено(Выборка.ДатаОкончания) И Дата > Выборка.ДатаОкончания) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Договор не действует на дату документа!";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Выборка.Процент = Null Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сотруднику не установлен процент оплаты работ! (Нет записи в регистре условий оплаты)";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	
	//запись движений
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	// Данные для расчета
	СтоимостьЧаса = Выборка.СтоимостьЧаса;
	ПроцентСотрудника = Выборка.Процент;
	
	СуммаВсегоПоДокументу = 0;
	ЧасыВсегоПоДокументу = 0;
	
	// Цикл по табличной части работ
	Для Каждого ТекСтрока Из ВКМ_ВыполненныеРаботы Цикл
		
		// 3.1. Движение по регистру "ВыполненныеКлиентуРаботы" 
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВКМ_Клиент = ВКМ_Клиент;
		Движение.ВКМ_Договор = ВКМ_Договор;
		Движение.ВКМ_КоличествоЧасов = ТекСтрока.ВКМ_ЧасыКОплатеКлиенту;
		Движение.ВКМ_СуммаКОплате = ТекСтрока.ВКМ_ЧасыКОплатеКлиенту * СтоимостьЧаса;
		ЧасыВсегоПоДокументу = ЧасыВсегоПоДокументу + ТекСтрока.ВКМ_ЧасыКОплатеКлиенту;
		СуммаВсегоПоДокументу = СуммаВсегоПоДокументу + (ТекСтрока.ВКМ_ЧасыКОплатеКлиенту * СтоимостьЧаса);
		
	КонецЦикла;
	
	Если ЧасыВсегоПоДокументу > 0 Тогда
		ДвижениеЗП = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		ДвижениеЗП.Период = Дата;
		ДвижениеЗП.ВКМ_Сотрудник = ВКМ_Специалист;
		ДвижениеЗП.ВКМ_ЧасовКОплате = ЧасыВсегоПоДокументу;
		СуммаСотруднику = СуммаВсегоПоДокументу * ПроцентСотрудника / 100;
		ДвижениеЗП.ВКМ_СуммаКОплате = СуммаСотруднику;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти