
Процедура СоздатьДокументыРеализации(ПараметрыЗапуска, АдресРезультата) Экспорт
	
	Период = ПараметрыЗапуска.Период;
	МассивДанных = ПараметрыЗапуска.ДанныеДляОбработки; // Массив структур с договорами
	
	МассивСозданныхДокументов = Новый Массив;
	
	Для Каждого СтрокаДанных Из МассивДанных Цикл
		
		Если ЗначениеЗаполнено(СтрокаДанных.Реализация) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
	
			НовыйДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДок.Дата = КонецМесяца(Период);
			НовыйДок.Контрагент = СтрокаДанных.Договор.Владелец; 
			НовыйДок.Договор = СтрокаДанных.Договор;
			НовыйДок.Организация = СтрокаДанных.Договор.Организация;
			НовыйДок.Ответственный = Пользователи.ТекущийПользователь(); 
			НовыйДок.ВКМ_ВыполнитьАвтозаполнение();
			
			Если НовыйДок.Услуги.Количество() > 0 Тогда
				НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
				ИнформацияОДокументе = Новый Структура;
				ИнформацияОДокументе.Вставить("Договор", СтрокаДанных.Договор);
				ИнформацияОДокументе.Вставить("Ссылка", НовыйДок.Ссылка);
				
				МассивСозданныхДокументов.Добавить(ИнформацияОДокументе);
			КонецЕсли;
			
		Исключение

			ЗаписьЖурналаРегистрации("ВКМ_МассовоеСоздание", УровеньЖурналаРегистрации.Ошибка, , , 
				"Ошибка по договору " + Строка(СтрокаДанных.Договор) + ": " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	

	ПоместитьВоВременноеХранилище(МассивСозданныхДокументов, АдресРезультата);
	
КонецПроцедуры

Процедура ВКМ_ЗаписьДокументаОбслуживанияПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НужноОтправитьУведомление = Ложь;
	
	Если Источник.ЭтоНовый() Тогда
		НужноОтправитьУведомление = Истина;
	Иначе
		Если Источник.ВКМ_Специалист <> Источник.Ссылка.ВКМ_Специалист 
			ИЛИ Источник.ВКМ_ДатаПроведенияРабот <> Источник.Ссылка.ВКМ_ДатаПроведенияРабот
			ИЛИ Источник.ВКМ_ВремяНачалаРабот <> Источник.Ссылка.ВКМ_ВремяНачалаРабот Тогда
			
			НужноОтправитьУведомление = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НужноОтправитьУведомление Тогда
		
		ТекстСообщения = "Обновление заявки!" + Символы.ПС +
						 "Клиент: " + Строка(Источник.ВКМ_Клиент) + Символы.ПС +
						 "Специалист: " + Строка(Источник.ВКМ_Специалист) + Символы.ПС +
						 "Дата: " + Формат(Источник.ВКМ_ДатаПроведенияРабот, "ДЛФ=D") + Символы.ПС +
						 "Время: " + Формат(Источник.ВКМ_ВремяНачалаРабот, "ДЛФ=T") + Символы.ПС +
						 "Проблема: " + Источник.ВКМ_ОписаниеПроблемы;
						 
		Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		Уведомление.ВКМ_ТекстСообщения = ТекстСообщения;
		Уведомление.Записать();
		
	КонецЕсли;
КонецПроцедуры