
Процедура ВКМ_ЗаписьДокументаОбслуживанияПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОтправитьУведомление = Ложь;
	
	// 1. Проверяем, новый ли это документ
	Если Источник.ЭтоНовый() Тогда
		ОтправитьУведомление = Истина;
	Иначе
		// 2. Если документ существует, проверяем изменение ключевых полей.
		Если (Источник.Ссылка.ВКМ_Специалист        <> Источник.ВКМ_Специалист)
			ИЛИ (Источник.Ссылка.ВКМ_ДатаПроведенияРабот <> Источник.ВКМ_ДатаПроведенияРабот)
			ИЛИ (Источник.Ссылка.ВКМ_ВремяНачалаРабот    <> Источник.ВКМ_ВремяНачалаРабот)
			ИЛИ (Источник.Ссылка.ВКМ_ВремяОкончанияРабот <> Источник.ВКМ_ВремяОкончанияРабот) Тогда
			
			ОтправитьУведомление = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// 3. Создаем запись в очереди сообщений
	Если ОтправитьУведомление Тогда
		
		ТекстСообщения = "";
		Если Источник.ЭтоНовый() Тогда
			ТекстСообщения = "Новая заявка на обслуживание!";
		Иначе
			ТекстСообщения = "Данные по заявке изменены!";
		КонецЕсли;
		
		ТекстСообщения = ТекстСообщения + Символы.ПС +
		                 "Клиент: " + Строка(Источник.ВКМ_Клиент) + Символы.ПС +
						 "Специалист: " + Строка(Источник.ВКМ_Специалист) + Символы.ПС +
		                 "Дата: " + Формат(Источник.ВКМ_ДатаПроведенияРабот, "ДЛФ=D") + Символы.ПС +
						 "Время: с " + Формат(Источник.ВКМ_ВремяНачалаРабот, "ДФ=ЧЧ:мм") + 
						 " по " + Формат(Источник.ВКМ_ВремяОкончанияРабот, "ДФ=ЧЧ:мм");
		
		// Создаем элемент справочника уведомлений
		Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		Уведомление.ВКМ_ТекстСообщения = ТекстСообщения;
		Уведомление.Записать();
		
	КонецЕсли;
	
КонецПроцедуры