// Обработчик подписки "ВКМ_ЗаписьДокументаОбслуживания"
// Событие: ПередЗаписью
// Источник: ДокументОбъект.ВКМ_ОбслуживаниеКлиента
Процедура ВКМ_ЗаписьДокументаОбслуживанияПриЗаписи(Источник, Отказ) Экспорт
	
	// 1. Технические проверки
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоНовый() 
		ИЛИ (Источник.Ссылка.ВКМ_Специалист        <> Источник.ВКМ_Специалист)
		ИЛИ (Источник.Ссылка.ВКМ_ДатаПроведенияРабот <> Источник.ВКМ_ДатаПроведенияРабот)
		ИЛИ (Источник.Ссылка.ВКМ_ВремяНачалаРабот    <> Источник.ВКМ_ВремяНачалаРабот)
		ИЛИ (Источник.Ссылка.ВКМ_ВремяОкончанияРабот <> Источник.ВКМ_ВремяОкончанияРабот) Тогда
		
		// Формируем текст сообщения
		ТекстСообщения = "Заявка обновлена!" + Символы.ПС +
		                 "Клиент: " + Источник.ВКМ_Клиент + Символы.ПС +
						 "Специалист: " + Источник.ВКМ_Специалист + Символы.ПС +
		                 "Дата: " + Формат(Источник.ВКМ_ДатаПроведенияРабот, "ДЛФ=D") + Символы.ПС +
						 "Время: с " + Формат(Источник.ВКМ_ВремяНачалаРабот, "ДФ=ЧЧ:мм") + 
						 " по " + Формат(Источник.ВКМ_ВремяОкончанияРабот, "ДФ=ЧЧ:мм");
		
		// Пишем в очередь
		Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		Уведомление.ВКМ_ТекстСообщения = ТекстСообщения;
		Уведомление.Записать();
		
	КонецЕсли;
	
КонецПроцедуры