
Процедура СоздатьДокументыРеализации(ПараметрыЗапуска, АдресРезультата) Экспорт
	
	Период = ПараметрыЗапуска.Период;
	МассивДанных = ПараметрыЗапуска.ДанныеДляОбработки; // Массив структур с договорами
	
	МассивСозданныхДокументов = Новый Массив;
	
	Для Каждого СтрокаДанных Из МассивДанных Цикл
		
		Если ЗначениеЗаполнено(СтрокаДанных.Реализация) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
	
			НовыйДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДок.Дата = КонецМесяца(Период);
			НовыйДок.Контрагент = СтрокаДанных.Договор.Владелец; 
			НовыйДок.Договор = СтрокаДанных.Договор;
			НовыйДок.Организация = СтрокаДанных.Договор.Организация;
			НовыйДок.Ответственный = Пользователи.ТекущийПользователь(); 
			НовыйДок.ВКМ_ВыполнитьАвтозаполнение();
			
			Если НовыйДок.Услуги.Количество() > 0 Тогда
				НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
				ИнформацияОДокументе = Новый Структура;
				ИнформацияОДокументе.Вставить("Договор", СтрокаДанных.Договор);
				ИнформацияОДокументе.Вставить("Ссылка", НовыйДок.Ссылка);
				
				МассивСозданныхДокументов.Добавить(ИнформацияОДокументе);
			КонецЕсли;
			
		Исключение

			ЗаписьЖурналаРегистрации("ВКМ_МассовоеСоздание", УровеньЖурналаРегистрации.Ошибка, , , 
				"Ошибка по договору " + Строка(СтрокаДанных.Договор) + ": " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	

	ПоместитьВоВременноеХранилище(МассивСозданныхДокументов, АдресРезультата);
	
КонецПроцедуры