#Область ОбработчикиПодписокНаСобытия

// Обработчик подписки "ВКМ_ЗаписьДокументаОбслуживания"
// Событие: ПередЗаписью
// Источник: ДокументОбъект.ВКМ_ОбслуживаниеКлиента
Процедура ВКМ_ЗаписьДокументаОбслуживанияПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоНовый() ИЛИ (Источник.Ссылка.ВКМ_Специалист <> Источник.ВКМ_Специалист) Тогда
		
		ТекстСообщения = "Новая заявка на обслуживание!" + Символы.ПС +
		                 "Клиент: " + Источник.ВКМ_Клиент + Символы.ПС +
		                 "Описание: " + Источник.ВКМ_ОписаниеПроблемы;
		
		// Создаем запись в справочнике-очереди
		Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		Уведомление.ВКМ_ТекстСообщения = ТекстСообщения;
		Уведомление.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти