&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	РассчитатьДни();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	РассчитатьДни();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДни()
	
	ТекСтрока = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекСтрока.ДатаНачала) 
		И ЗначениеЗаполнено(ТекСтрока.ДатаОкончания) Тогда
		
		// В сутках 86400 секунд. +1, т.к. дни включительно.
		ТекСтрока.ВсегоДней = (ТекСтрока.ДатаОкончания - ТекСтрока.ДатаНачала) / 86400 + 1;
		
	Иначе
		ТекСтрока.ВсегоДней = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	// 1. Помещаем текущие данные формы (Объект) во временное хранилище
	// УникальныйИдентификатор нужен, чтобы хранилище жило пока жива форма
	АдресХранилища = ПоместитьВоВременноеХранилище(Объект, УникальныйИдентификатор);
	
	// 2. Готовим параметры для открытия второй формы
	ПараметрыФормы = Новый Структура("АдресВХранилище", АдресХранилища);
	
	// 3. Открываем форму анализа
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы);
	
КонецПроцедуры