&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	РассчитатьДни();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	РассчитатьДни();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДни()
	
	ТекСтрока = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекСтрока.ДатаНачала) 
		И ЗначениеЗаполнено(ТекСтрока.ДатаОкончания) Тогда
		
		// В сутках 86400 секунд. +1, т.к. дни включительно.
		ТекСтрока.ВсегоДней = (ТекСтрока.ДатаОкончания - ТекСтрока.ДатаНачала) / 86400 + 1;
		
	Иначе
		ТекСтрока.ВсегоДней = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	// 1. Вместо прямой записи, вызываем серверную функцию
	АдресХранилища = ПоместитьВХранилищеНаСервере();
	
	// 2. Упаковываем адрес в параметры
	ПараметрыФормы = Новый Структура("АдресВХранилище", АдресХранилища);
	
	// 3. Открываем форму анализа
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВХранилищеНаСервере()
	
	// Конвертируем данные формы в реальный ОбъектДокумента (в памяти).
	// Такой объект легко помещается в хранилище.
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	// Помещаем в хранилище
	Возврат ПоместитьВоВременноеХранилище(ДокОбъект, УникальныйИдентификатор);
	
КонецФункции