&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// 1. Получаем адрес из параметров
	Адрес = Параметры.АдресВХранилище;
	
	// 2. Получаем данные (это ДанныеФормыСтруктура, копия Объекта из первой формы)
	ДанныеГрафика = ПолучитьИзВременногоХранилища(Адрес);
	
	// 3. Настраиваем диаграмму
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	ДиаграммаГанта.ОтображатьЗаголовок = Ложь;
	
	// 4. Заполняем данными
	Для Каждого СтрокаТЧ Из ДанныеГрафика.ОтпускаСотрудников Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаНачала) 
			Или Не ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;
		
		// Точка = Сотрудник
		Точка = ДиаграммаГанта.УстановитьТочку(СтрокаТЧ.Сотрудник);
		
		// Серия = Просто "Отпуск" (можно сделать год)
		Серия = ДиаграммаГанта.УстановитьСерию("Основной отпуск");
		
		// Получаем значение (интервалы) на пересечении Точки и Серии
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		// Добавляем интервал
		Интервал = Значение.Добавить();
		Интервал.Начало = СтрокаТЧ.ДатаНачала;
		Интервал.Конец   = СтрокаТЧ.ДатаОкончания;
		
		// Можно раскрасить
		Интервал.Цвет = WebЦвета.Зеленый;
		
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры