&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    Адрес = Параметры.АдресВХранилище;
	
	// Теперь здесь лежит ТаблицаЗначений, а не ДокументОбъект
	ТаблицаОтпусков = ПолучитьИзВременногоХранилища(Адрес);
	
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	ДиаграммаГанта.ОтображатьЗаголовок = Ложь;
	ДиаграммаГанта.ОтображатьЛегенду = Ложь;
	
	// Бежим сразу по таблице (без .ОтпускаСотрудников)
	Для Каждого СтрокаТЧ Из ТаблицаОтпусков Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаНачала) 
			Или Не ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;
		
		Точка = ДиаграммаГанта.УстановитьТочку(СтрокаТЧ.Сотрудник);
		Серия = ДиаграммаГанта.УстановитьСерию("Основной отпуск");
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = СтрокаТЧ.ДатаНачала;
		Интервал.Конец  = СтрокаТЧ.ДатаОкончания;
		Интервал.Цвет = WebЦвета.КоролевскийСиний; 
		
		// Если вы добавляли колонку ВсегоДней в ТЧ объекта, она здесь тоже будет доступна
		// Интервал.Текст = "Дней: " + СтрокаТЧ.ВсегоДней;
		
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры