&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Параметры.АдресВХранилище;
	ТаблицаОтпусков = ПолучитьИзВременногоХранилища(Адрес);
	
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	
	// Настройки внешнего вида
	ДиаграммаГанта.ОтображатьЗаголовок = Ложь;
	ДиаграммаГанта.ОтображатьЛегенду = Ложь; // Легенда обычно не нужна, если все отпуска одного цвета
	ДиаграммаГанта.ОтображатьТочки = Истина; // Обязательно показывать подписи слева
	
	Для Каждого СтрокаТЧ Из ТаблицаОтпусков Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаНачала) 
			Или Не ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;
		
		// --- БЛОК С ТОЧКОЙ (Сотрудник) ---
		Точка = ДиаграммаГанта.УстановитьТочку(СтрокаТЧ.Сотрудник);
		
		// Явное назначение имени
		ИмяСотрудника = Строка(СтрокаТЧ.Сотрудник);
		If ПустаяСтрока(ИмяСотрудника) Тогда
			Точка.Текст = "Без имени"; // Чтобы видеть, если проблема в справочнике
		Иначе
			Точка.Текст = ИмяСотрудника;
		КонецЕсли;
		// ---------------------------------
		
		// Серия
		Серия = ДиаграммаГанта.УстановитьСерию("Основной отпуск");
		
		// Значение и Интервал
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = СтрокаТЧ.ДатаНачала;
		Интервал.Конец  = СтрокаТЧ.ДатаОкончания;
		Интервал.Цвет = Новый Цвет(65, 105, 225);
		
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры

