Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДеревоПланировщика = Элементы.ДеревоПланировщика;
	ИнициализироватьПланировщик();
	ЗаполнитьПланировщикНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьПланировщик()
	// Настройка периода
	ДеревоПланировщика.ТекущиеПериодыОтображения.Очистить();
	ДеревоПланировщика.ТекущиеПериодыОтображения.Добавить(
		НачалоДня(ТекущаяДата()),
		КонецДня(ТекущаяДата())
	);

	// Проверка наличия свойства
	Настройки = ДеревоПланировщика.НастройкиОтображения;
	Если Настройки <> Неопределено Тогда
		Настройки.ЕдиницаШкалыВремени = ТипЕдиницыШкалыВремени.Час;
		Настройки.КратностьЕдиницыШкалы = 1;
	Иначе
		Сообщить("Ошибка: свойство НастройкиОтображения не найдено!");
		Возврат;
	КонецЕсли;

	// Измерения
	ДеревоПланировщика.Измерения.Очистить();
	ИзмерениеСпециалист = ДеревоПланировщика.Измерения.Добавить("Специалист");

	// Элементы
	ДеревоПланировщика.Элементы.Очистить();

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Ссылка КАК Ссылка,
	|	Наименование КАК Наименование
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ ПометкаУдаления");
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Элемент = ДеревоПланировщика.Элементы.Добавить(Выборка.Ссылка);
		Элемент.Текст = Выборка.Наименование;
	КонецЦикла;
КонецПроцедуры


// Заполнение планировщика событиями

&НаСервере
Процедура ЗаполнитьПланировщикНаСервере()

	Если ДеревоПланировщика.Измерения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ИзмерениеСпециалист = ДеревоПланировщика.Измерения.Получить(0);

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка,
		|	ВКМ_ДатаПроведенияРабот КАК Дата,
		|	ВКМ_ВремяНачалаРабот КАК Начало,
		|	ВКМ_ВремяОкончанияРабот КАК Конец,
		|	ВКМ_ОписаниеПроблемы КАК Описание,
		|	ВКМ_Специалист КАК Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	НЕ ПометкаУдаления");

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		
		// Найдём сотрудника
		КорневойЭл = ДеревоПланировщика.Элементы.Найти(Выборка.Специалист);

		Если КорневойЭл = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Запись = КорневойЭл.Добавить(Выборка.Ссылка);
		Запись.Начало = СоединитьДатуИВремя(Выборка.Дата, Выборка.Начало);
		Запись.Конец  = СоединитьДатуИВремя(Выборка.Дата, Выборка.Конец);
		Запись.Текст  = Выборка.Описание;
		Запись.ЗначенияИзмерений = Новый Соответствие;
		Запись.ЗначенияИзмерений.Вставить(ИзмерениеСпециалист, Выборка.Специалист);

	КонецЦикла;

КонецПроцедуры


&НаСервереБезКонтекста
Функция СоединитьДатуИВремя(ДатаДаты, ДатаВремени)

	Если ДатаДаты = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ДатаВремени = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат НачалоДня(ДатаДаты) 
		+ (ДатаВремени - НачалоДня(ДатаВремени));

КонецФункции