&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Планировщик
	
	ДеревоПланировщика.ТекущиеПериодыОтображения.Очистить();
	ДеревоПланировщика.ТекущиеПериодыОтображения.Добавить(НачалоДня(ТекущаяДата()), КонецДня(ТекущаяДата())); 
	ДеревоПланировщика.ШкалаВремени = ТипЕдиницыШкалыВремени.Час;
	ДеревоПланировщика.ШкалаВремени.Кратность = 1; 
	
	// Измерения

	ДеревоПланировщика.Элементы.Очистить();
	
	ЗапросСотрудники = Новый Запрос;
	ЗапросСотрудники.Текст = "ВЫБРАТЬ
	|	Ссылка КАК Ссылка,
	|	Наименование КАК Наименование
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ ПометкаУдаления";
	ВыборкаСотр = ЗапросСотрудники.Выполнить().Выбрать();
	
	Пока ВыборкаСотр.Следующий() Цикл
		НовыйСотрудник = ДеревоПланировщика.Элементы.Добавить(ВыборкаСотр.Ссылка); 
		НовыйСотрудник.Текст = ВыборкаСотр.Наименование;
	КонецЦикла;
	
	// Загружаем данные из документов
	ЗаполнитьПланировщикНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПланировщикНаСервере()
	
	ДеревоПланировщика.Элементы.Очистить(); 
	
	ЗапросСотрудники = Новый Запрос;
	ЗапросСотрудники.Текст = "ВЫБРАТЬ
	|	Ссылка КАК Ссылка,
	|	Наименование КАК Наименование
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ ПометкаУдаления";
	ВыборкаСотр = ЗапросСотрудники.Выполнить().Выбрать();
	
	Пока ВыборкаСотр.Следующий() Цикл
		НовыйСотрудник = ДеревоПланировщика.Элементы.Добавить(ВыборкаСотр.Ссылка);
		НовыйСотрудник.Текст = ВыборкаСотр.Наименование;
	КонецЦикла;

	// получаем документы
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Обслуживание.Ссылка КАК Ссылка,
		|	Обслуживание.ВКМ_ДатаПроведенияРабот КАК Дата,
		|	Обслуживание.ВКМ_ВремяНачалаРабот КАК Начало,
		|	Обслуживание.ВКМ_ВремяОкончанияРабот КАК Окончание,
		|	Обслуживание.ВКМ_ОписаниеПроблемы КАК Описание,
		|	Обслуживание.ВКМ_Специалист КАК Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК Обслуживание
		|ГДЕ
		|	НЕ Обслуживание.ПометкаУдаления"; 
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЭлементРасписания = ДеревоПланировщика.Элементы.Найти(Выборка.Специалист);
		
		Если ЭлементРасписания <> Неопределено Тогда
			
			Запись = ДеревоПланировщика.Элементы.Добавить(Выборка.Ссылка); 
			Запись.Начало = СоединитьДатуИВремя(Выборка.Дата, Выборка.Начало);
			Запись.Конец = СоединитьДатуИВремя(Выборка.Дата, Выборка.Окончание);
			Запись.Текст = Выборка.Описание;
			Запись.ЗначенияИзмерений = Новый Соответствие;
			Запись.ЗначенияИзмерений.Вставить(ДеревоПланировщика.Измерения.Получить(0), Выборка.Специалист);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоединитьДатуИВремя(ДатаДаты, ДатаВремени)

	Возврат НачалоДня(ДатаДаты) + (ДатаВремени - НачалоДня(ДатаВремени));
	
КонецФункции