Процедура ОбработкаПроведения(Отказ, Режим)
    Движения.ВКМ_ПланируемыеОтпуска.Записывать = Истина;
    Для Каждого ТекСтрока Из ОтпускаСотрудников Цикл
        Движение = Движения.ВКМ_ПланируемыеОтпуска.Добавить();
        Движение.Период = Дата; // Или 1 января года графика
        Движение.Сотрудник = ТекСтрока.Сотрудник;
        Движение.КоличествоДней = ТекСтрока.ВсегоДней; // У вас это Строка или Число? Лучше Число.
        // Если в ТЧ "ВсегоДней" - строка (как в выгрузке), приведите к Числу!
    КонецЦикла;
КонецПроцедуры