#Область ОбработкаПроведения

Процедура ОбработкаПроведения(Отказ, Режим)
	
    // 1. Очистка движений.
    Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
    Движения.ВКМ_ОсновныеНачисления.Очистить();

    Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
    Движения.ВКМ_ДополнительныеНачисления.Очистить();

    Движения.ВКМ_Удержания.Записывать = Истина;
    Движения.ВКМ_Удержания.Очистить();

    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();

    // 2. Пустые движения (все строки документа)
    СформироватьДвиженияПоОкладам(Отказ); 
    СформироватьДвиженияПоДругимНачислениям();

    // 3. Техническая запись 
    Движения.ВКМ_ОсновныеНачисления.Записать();

    // 4. Расчёт отпускных
    РассчитатьОтпускные();
    Движения.ВКМ_ОсновныеНачисления.Записать();

    // 5. Расчёт оклада
    РассчитатьОклад();
    Движения.ВКМ_ОсновныеНачисления.Записать();

    // 6. Расчёт премий
    РассчитатьПремии();
    Движения.ВКМ_ДополнительныеНачисления.Записать();

    // 7. Сторно
    СформироватьСторноЗаписи();

    // 8. НДФЛ
    РассчитатьНДФЛ();
    Движения.ВКМ_Удержания.Записать();

    // 9. Взаиморасчёты
    ЗаполнитьВзаиморасчеты();
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

Процедура СформироватьДвиженияПоОкладам(Отказ)
	
	МинимальнаяДатаНачала = Неопределено;
	МаксимальнаяДатаОкончания = Неопределено;
	
	ЕстьОклад = Ложь;
	Для Каждого Строка Из Начисления Цикл
		Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			ЕстьОклад = Истина;
			Если МинимальнаяДатаНачала = Неопределено Или Строка.ДатаНачала < МинимальнаяДатаНачала Тогда
				МинимальнаяДатаНачала = Строка.ДатаНачала;
			КонецЕсли;
			Если МаксимальнаяДатаОкончания = Неопределено Или Строка.ДатаОкончания > МаксимальнаяДатаОкончания Тогда
				МаксимальнаяДатаОкончания = Строка.ДатаОкончания;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьОклад Тогда Возврат; КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧ.Сотрудник КАК Сотрудник,
	|	ТЧ.ВидРасчета КАК ВидРасчета,
	|	ТЧ.ДатаНачала КАК ДатаНачала,
	|	ТЧ.ДатаОкончания КАК ДатаОкончания,
	|	ТЧ.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|	И ТЧ.ВидРасчета = &ВидРасчетаОклад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследних.ВКМ_Сотрудник КАК Сотрудник,
	|	СрезПоследних.Период КАК Период,
	|	СрезПоследних.ВКМ_Оклад КАК Оклад
	|ПОМЕСТИТЬ ВТ_История
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&МинимальнаяДатаНачала, ВКМ_Сотрудник В
	|		(ВЫБРАТЬ
	|			Т.Сотрудник
	|		ИЗ
	|			ВТ_ТЧ КАК Т)) КАК СрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	История.ВКМ_Сотрудник,
	|	История.Период,
	|	История.ВКМ_Оклад
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК История
	|ГДЕ
	|	История.Период > &МинимальнаяДатаНачала
	|	И История.Период <= &МаксимальнаяДатаОкончания
	|	И История.ВКМ_Сотрудник В
	|		(ВЫБРАТЬ
	|			Т.Сотрудник
	|		ИЗ
	|			ВТ_ТЧ КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вложенный.Сотрудник КАК Сотрудник,
	|	Вложенный.ДатаНачала КАК ДатаНачала,
	|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(Вложенный.СледующаяДата, СЕКУНДА, -1), ДАТАВРЕМЯ(3999, 12, 31)) КАК ДатаОкончания,
	|	Вложенный.Оклад КАК Оклад
	|ПОМЕСТИТЬ ВТ_Интервалы
	|ИЗ
	|	(ВЫБРАТЬ
	|		История.Сотрудник КАК Сотрудник,
	|		История.Период КАК ДатаНачала,
	|		История.Оклад КАК Оклад,
	|		МИНИМУМ(ИсторияСлед.Период) КАК СледующаяДата
	|	ИЗ
	|		ВТ_История КАК История
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_История КАК ИсторияСлед
	|			ПО История.Сотрудник = ИсторияСлед.Сотрудник
	|			И История.Период < ИсторияСлед.Период
	|	СГРУППИРОВАТЬ ПО
	|		История.Сотрудник,
	|		История.Период,
	|		История.Оклад) КАК Вложенный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧ.Сотрудник КАК Сотрудник,
	|	ВТ_ТЧ.ВидРасчета КАК ВидРасчета,
	|	ВТ_ТЧ.ГрафикРаботы КАК ГрафикРаботы,
	|	ВЫБОР
	|		КОГДА ВТ_ТЧ.ДатаНачала > ВТ_Интервалы.ДатаНачала
	|			ТОГДА ВТ_ТЧ.ДатаНачала
	|		ИНАЧЕ ВТ_Интервалы.ДатаНачала
	|	КОНЕЦ КАК ПериодДействияНачало,
	|	ВЫБОР
	|		КОГДА ВТ_ТЧ.ДатаОкончания < ВТ_Интервалы.ДатаОкончания
	|			ТОГДА ВТ_ТЧ.ДатаОкончания
	|		ИНАЧЕ ВТ_Интервалы.ДатаОкончания
	|	КОНЕЦ КАК ПериодДействияКонец,
	|	ВТ_Интервалы.Оклад КАК ВКМ_Показатель
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Интервалы КАК ВТ_Интервалы
	|		ПО ВТ_ТЧ.Сотрудник = ВТ_Интервалы.Сотрудник
	|		И ВТ_ТЧ.ДатаНачала <= ВТ_Интервалы.ДатаОкончания
	|		И ВТ_ТЧ.ДатаОкончания >= ВТ_Интервалы.ДатаНачала";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчетаОклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("МинимальнаяДатаНачала", МинимальнаяДатаНачала);
	Запрос.УстановитьПараметр("МаксимальнаяДатаОкончания", МаксимальнаяДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
		
		Движение.ВКМ_Сотрудник = Выборка.Сотрудник;
		
		Движение.ПериодРегистрации = Дата;
		
		Если Движение.ВКМ_Показатель = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Внимание: У сотрудника " + Строка(Выборка.Сотрудник) + " оклад равен 0 в регистре условий оплаты!";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьДвиженияПоДругимНачислениям()
	
	Для Каждого Строка Из Начисления Цикл
		Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = Строка.ДатаНачала;
		Движение.ПериодДействияКонец = Строка.ДатаОкончания;
		Движение.ВКМ_Сотрудник    = Строка.Сотрудник;
		//Движение.ВКМ_ГрафикРаботы = Строка.ГрафикРаботы;
		
		Движение.ВидРасчета = Строка.ВидРасчета;
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьОклад()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ДанныеГрафика.ВКМ_ЗначениеФактическийПериодДействия, 0) КАК Отработано,
	|	ЕСТЬNULL(ДанныеГрафика.ВКМ_ЗначениеПериодДействия, 0) КАК Норма
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
	|	И ВидРасчета = &ВидРасчетаОклад) КАК ДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчетаОклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		
		Ставка = ?(Движение.ВКМ_Показатель = 0, 0, Движение.ВКМ_Показатель);
		
		Если Выборка.Норма = 0 Тогда
			Движение.ВКМ_Результат = 0;
		Иначе
			Движение.ВКМ_Результат = Ставка * Выборка.Отработано / Выборка.Норма;
		КонецЕсли;
		
		Движение.ВКМ_ОтработаноДней = Окр(Выборка.Отработано / 8, 2);
		
		Если Движение.Сторно Тогда
			Движение.ВКМ_Результат = -Движение.ВКМ_Результат;
			Движение.ВКМ_ОтработаноДней = -Движение.ВКМ_ОтработаноДней;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьСторноЗаписи()
	
	СторноЗаписи = Движения.ВКМ_ОсновныеНачисления.ПолучитьДополнение();
	
	Для Каждого СтрокаСторно Из СторноЗаписи Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаСторно);
		
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = СтрокаСторно.ПериодДействияНачалоСторно;
		Движение.ПериодДействияКонец = СтрокаСторно.ПериодДействияКонецСторно;
		Движение.Сторно = Истина;
		
		Движение.ВКМ_Результат = -СтрокаСторно.ВКМ_Результат;
		Движение.ВКМ_ОтработаноДней = -СтрокаСторно.ВКМ_ОтработаноДней;
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьПремии()
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_ДополнительныеНачисления.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧ.Сотрудник КАК Сотрудник,
	|	ТЧ.ВидРасчета КАК ВидРасчета,
	|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.ВКМ_СуммаКОплатеОборот, 0) КАК БазаНачисления
	|ИЗ
	|	Документ.ВКМ_НачисленияЗарплаты.ДополнительныеНачисления КАК ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода,,) КАК
	|			ВКМ_ВыполненныеСотрудникомРаботыОбороты
	|		ПО ТЧ.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.ВКМ_Сотрудник
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|	И ТЧ.ВидРасчета = &ВидРасчетаПроцент";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	
	
	Запрос.УстановитьПараметр("ВидРасчетаПроцент", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Процент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВКМ_Сотрудник = Выборка.Сотрудник;
		Движение.ВидРасчета = Выборка.ВидРасчета;
		Движение.ВКМ_Результат = Выборка.БазаНачисления;
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
КонецПроцедуры

Процедура РассчитатьНДФЛ()
	
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_Удержания.Очистить();

	ТЗ_Сотрудники = Начисления.Выгрузить(,"Сотрудник");
	ТЗ_Сотрудники.Свернуть("Сотрудник");
	
	Для Каждого СтрокаСотрудник Из ТЗ_Сотрудники Цикл
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВКМ_Сотрудник = СтрокаСотрудник.Сотрудник;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец  = КонецМесяца(Дата);
		Движение.ВКМ_Результат = 0;
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БазаОсн.ВКМ_Сотрудник КАК Сотрудник,
	|	БазаОсн.ВКМ_РезультатБаза КАК РезультатБаза
	|ПОМЕСТИТЬ ВТ_База
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения,, Регистратор = &Ссылка) КАК БазаОсн
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БазаДоп.ВКМ_Сотрудник,
	|	БазаДоп.ВКМ_РезультатБаза
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения,, Регистратор = &Ссылка) КАК
	|		БазаДоп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_База.Сотрудник КАК Сотрудник,
	|	СУММА(ВТ_База.РезультатБаза) КАК База
	|ИЗ
	|	ВТ_База КАК ВТ_База
	|СГРУППИРОВАТЬ ПО
	|	ВТ_База.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Измерения = Новый Массив;
	Измерения.Добавить("ВКМ_Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		
		Для Каждого Движение Из Движения.ВКМ_Удержания Цикл
			Если Движение.ВКМ_Сотрудник = Выборка.Сотрудник Тогда
				Движение.ВКМ_Результат = Окр(Выборка.База * 0.13, 0); 
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьВзаиморасчеты()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисления.ВКМ_Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_ОсновныеНачисления.ВКМ_Результат) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Начисления
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|ГДЕ
	|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОсновныеНачисления.ВКМ_Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисления.ВКМ_Сотрудник,
	|	СУММА(ВКМ_ДополнительныеНачисления.ВКМ_Результат)
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|ГДЕ
	|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ДополнительныеНачисления.ВКМ_Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВКМ_Удержания.ВКМ_Сотрудник,
	|	-СУММА(ВКМ_Удержания.ВКМ_Результат)
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	|ГДЕ
	|	ВКМ_Удержания.Регистратор = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_Удержания.ВКМ_Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Начисления.Сотрудник КАК Сотрудник,
	|	СУММА(ВТ_Начисления.Сумма) КАК Сумма
	|ИЗ
	|	ВТ_Начисления КАК ВТ_Начисления
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Начисления.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ВКМ_Сотрудник = Выборка.Сотрудник;
		Движение.ВКМ_Сумма = Выборка.Сумма;
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры

Процедура РассчитатьОтпускные()
	
	
   Движения.ВКМ_ФактическиеОтпуска.Записывать = Истина;

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ТЧ.НомерСтроки КАК НомерСтроки,
    |	ТЧ.Сотрудник КАК Сотрудник,
    |	ТЧ.ДатаНачала КАК ДатаНачала,
    |	ТЧ.ДатаОкончания КАК ДатаОкончания,
    |	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ТЧ.ДатаНачала, МЕСЯЦ), МЕСЯЦ, -12) КАК НачалоБазовогоПериода,
    |	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ТЧ.ДатаНачала, МЕСЯЦ), СЕКУНДА, -1) КАК КонецБазовогоПериода
    |ПОМЕСТИТЬ ВТ_Данные
    |ИЗ
    |	Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ТЧ
    |ГДЕ
    |	ТЧ.Ссылка = &Ссылка
    |	И ТЧ.ВидРасчета = &ВидРасчетаОтпуск
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ВТ.НомерСтроки КАК НомерСтроки,
    |	ВТ.Сотрудник КАК Сотрудник,
    |	ВТ.ДатаНачала КАК ДатаНачала,
    |	ВТ.ДатаОкончания КАК ДатаОкончания,
    |	ЕСТЬNULL(Оклад.ВКМ_Результат, 0) КАК РезультатОклад,
    |	ЕСТЬNULL(Оклад.ВКМ_ОтработаноДней, 0) КАК ОтработаноДней,
    |	ЕСТЬNULL(Процент.ВКМ_Результат, 0) КАК РезультатПроцент
    |ИЗ
    |	ВТ_Данные КАК ВТ
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления КАК Оклад
    |		ПО ВТ.Сотрудник = Оклад.ВКМ_Сотрудник
    |		И Оклад.ПериодРегистрации МЕЖДУ ВТ.НачалоБазовогоПериода И ВТ.КонецБазовогоПериода
    |		И Оклад.ВидРасчета = &ВидОклад
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ДополнительныеНачисления КАК Процент
    |		ПО ВТ.Сотрудник = Процент.ВКМ_Сотрудник
    |		И Процент.ПериодРегистрации МЕЖДУ ВТ.НачалоБазовогоПериода И ВТ.КонецБазовогоПериода
    |		И Процент.ВидРасчета = &ВидПроцент";
   
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    Запрос.УстановитьПараметр("ВидРасчетаОтпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
    Запрос.УстановитьПараметр("ВидОклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
    Запрос.УстановитьПараметр("ВидПроцент", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Процент);
  
    ТаблицаДанных = Запрос.Выполнить().Выгрузить();

    ТаблицаДанных.Свернуть(
        "НомерСтроки, Сотрудник, ДатаНачала, ДатаОкончания",
        "РезультатОклад, ОтработаноДней, РезультатПроцент" );

    Для Каждого Строка Из ТаблицаДанных Цикл

        Если Строка.ДатаНачала = Неопределено Или Строка.ДатаОкончания = Неопределено Тогда
            Продолжить;
        КонецЕсли;

        // Расчет дней 
        ДнейОтпуска = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400 + 1;

        // Расчет суммы
        СуммаБазы = Строка.РезультатОклад + Строка.РезультатПроцент;
        СреднийЗаработок = ?(Строка.ОтработаноДней > 0, СуммаБазы / Строка.ОтработаноДней, 0);
        СуммаНачисления = СреднийЗаработок * ДнейОтпуска;

        // Запись в Регистр Расчета (Деньги)
        Движение = Движения.ВКМ_ОсновныеНачисления[Строка.НомерСтроки - 1];
        Движение.ВКМ_Результат = СуммаНачисления;
        Движение.ВКМ_ОтработаноДней = ДнейОтпуска;

        //  Запись в Регистр Накопления (Факт дней для отчета)
        ДвижениеФакт = Движения.ВКМ_ФактическиеОтпуска.Добавить();
        ДвижениеФакт.Период = Дата; 
        ДвижениеФакт.ВКМ_Сотрудник = Строка.Сотрудник;
        ДвижениеФакт.ВКМ_Дней = ДнейОтпуска; 

    КонецЦикла;
	
КонецПроцедуры

#КонецОбласти