#Область ОбработкаПроведения

Процедура ОбработкаПроведения(Отказ, Режим)
	
// 1. Инициализация
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Движения.ВКМ_ОсновныеНачисления.Очистить();
	
	// 2. Формирование движений по Окладу
	СформироватьДвиженияПоОкладам(Отказ);
	
	// 3. Формирование остальных движений
	СформироватьДвиженияПоДругимНачислениям();
	
	// 4. Сторно
	СформироватьСторноЗаписи();
	
	Если Отказ Тогда Возврат; КонецЕсли;
	
	// 5. Первая запись (чтобы построить График)
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
	// 6. Расчеты
	
	// 6.1 Считаем Оклад
	РассчитатьОклад();
	
	// !!! ВАЖНОЕ ИСПРАВЛЕНИЕ !!!
	// Записываем рассчитанный оклад в базу, чтобы запрос НДФЛ его увидел
	Движения.ВКМ_ОсновныеНачисления.Записать(); 
	
	// 6.2 Считаем Премии (внутри этой процедуры тоже есть запись)
	РассчитатьПремии();
	
	// 6.3 Считаем НДФЛ
	// Теперь запрос увидит и Оклад (мы его записали выше), и Премию
	РассчитатьНДФЛ();
	
	// Финальная запись не обязательна, если мы все записали по ходу, 
	// но можно оставить для надежности
	// Движения.ВКМ_ОсновныеНачисления.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

// Самая важная процедура: разбивает месяц на части, если менялся оклад
Процедура СформироватьДвиженияПоОкладам(Отказ)
	
	// А. Определяем границы периода документа
	МинимальнаяДатаНачала = Неопределено;
	МаксимальнаяДатаОкончания = Неопределено;
	
	ЕстьОклад = Ложь;
	Для Каждого Строка Из Начисления Цикл
		Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			ЕстьОклад = Истина;
			Если МинимальнаяДатаНачала = Неопределено Или Строка.ДатаНачала < МинимальнаяДатаНачала Тогда
				МинимальнаяДатаНачала = Строка.ДатаНачала;
			КонецЕсли;
			Если МаксимальнаяДатаОкончания = Неопределено Или Строка.ДатаОкончания > МаксимальнаяДатаОкончания Тогда
				МаксимальнаяДатаОкончания = Строка.ДатаОкончания;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьОклад Тогда Возврат; КонецЕсли;

	// Б. Строим таблицу интервалов действия окладов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧ.Сотрудник КАК Сотрудник,
	|	ТЧ.ВидРасчета КАК ВидРасчета,
	|	ТЧ.ДатаНачала КАК ДатаНачала,
	|	ТЧ.ДатаОкончания КАК ДатаОкончания,
	|	ТЧ.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|	И ТЧ.ВидРасчета = &ВидРасчетаОклад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследних.Сотрудник КАК Сотрудник,
	|	СрезПоследних.Период КАК Период,
	|	СрезПоследних.Оклад КАК Оклад
	|ПОМЕСТИТЬ ВТ_История
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&МинимальнаяДатаНачала, Сотрудник В
	|		(ВЫБРАТЬ
	|			Т.Сотрудник
	|		ИЗ
	|			ВТ_ТЧ КАК Т)) КАК СрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	История.Сотрудник,
	|	История.Период,
	|	История.Оклад
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК История
	|ГДЕ
	|	История.Период > &МинимальнаяДатаНачала
	|	И История.Период <= &МаксимальнаяДатаОкончания
	|	И История.Сотрудник В
	|		(ВЫБРАТЬ
	|			Т.Сотрудник
	|		ИЗ
	|			ВТ_ТЧ КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вложенный.Сотрудник КАК Сотрудник,
	|	Вложенный.ДатаНачала КАК ДатаНачала,
	|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(Вложенный.СледующаяДата, СЕКУНДА, -1), ДАТАВРЕМЯ(3999, 12, 31)) КАК ДатаОкончания,
	|	Вложенный.Оклад КАК Оклад
	|ПОМЕСТИТЬ ВТ_Интервалы
	|ИЗ
	|	(ВЫБРАТЬ
	|		История.Сотрудник КАК Сотрудник,
	|		История.Период КАК ДатаНачала,
	|		История.Оклад КАК Оклад,
	|		МИНИМУМ(ИсторияСлед.Период) КАК СледующаяДата
	|	ИЗ
	|		ВТ_История КАК История
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_История КАК ИсторияСлед
	|			ПО История.Сотрудник = ИсторияСлед.Сотрудник
	|			И История.Период < ИсторияСлед.Период
	|	СГРУППИРОВАТЬ ПО
	|		История.Сотрудник,
	|		История.Период,
	|		История.Оклад) КАК Вложенный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧ.Сотрудник КАК Сотрудник,
	|	ВТ_ТЧ.ВидРасчета КАК ВидРасчета,
	|	ВТ_ТЧ.ГрафикРаботы КАК ГрафикРаботы,
	|	ВЫБОР
	|		КОГДА ВТ_ТЧ.ДатаНачала > ВТ_Интервалы.ДатаНачала
	|			ТОГДА ВТ_ТЧ.ДатаНачала
	|		ИНАЧЕ ВТ_Интервалы.ДатаНачала
	|	КОНЕЦ КАК ПериодДействияНачало,
	|	ВЫБОР
	|		КОГДА ВТ_ТЧ.ДатаОкончания < ВТ_Интервалы.ДатаОкончания
	|			ТОГДА ВТ_ТЧ.ДатаОкончания
	|		ИНАЧЕ ВТ_Интервалы.ДатаОкончания
	|	КОНЕЦ КАК ПериодДействияКонец,
	|	ВТ_Интервалы.Оклад КАК ВКМ_Показатель
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Интервалы КАК ВТ_Интервалы
	|		ПО ВТ_ТЧ.Сотрудник = ВТ_Интервалы.Сотрудник
	|		И ВТ_ТЧ.ДатаНачала <= ВТ_Интервалы.ДатаОкончания
	|		И ВТ_ТЧ.ДатаОкончания >= ВТ_Интервалы.ДатаНачала";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчетаОклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("МинимальнаяДатаНачала", МинимальнаяДатаНачала);
	Запрос.УстановитьПараметр("МаксимальнаяДатаОкончания", МаксимальнаяДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
		Движение.ПериодРегистрации = Дата;
		
		// Проверка заполнения оклада
		Если Движение.ВКМ_Показатель = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Внимание: У сотрудника " + Строка(Выборка.Сотрудник) + " оклад равен 0 в регистре условий оплаты!";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьДвиженияПоДругимНачислениям()
	
	Для Каждого Строка Из Начисления Цикл
		Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			Продолжить; 
		КонецЕсли;
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации    = Дата;
		Движение.ПериодДействияНачало = Строка.ДатаНачала;
		Движение.ПериодДействияКонец  = Строка.ДатаОкончания;
		Движение.Сотрудник            = Строка.Сотрудник;
		Движение.ВидРасчета           = Строка.ВидРасчета;
		Движение.ГрафикРаботы         = Строка.ГрафикРаботы;
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьОклад()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Отработано,
	|	ЕСТЬNULL(ДанныеГрафика.ЗначениеПериодДействия, 0) КАК Норма
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
	|	И ВидРасчета = &ВидРасчетаОклад) КАК ДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчетаОклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		
		Ставка = ?(Движение.ВКМ_Показатель = 0, 0, Движение.ВКМ_Показатель); 
		
		Если Выборка.Норма = 0 Тогда
			Движение.ВКМ_Результат = 0;
		Иначе
			Движение.ВКМ_Результат = Ставка * Выборка.Отработано / Выборка.Норма;
		КонецЕсли;
		
		Движение.ВКМ_ОтработаноДней = Выборка.Отработано;
		
		Если Движение.Сторно Тогда
			Движение.ВКМ_Результат = -Движение.ВКМ_Результат;
			Движение.ВКМ_ОтработаноДней = -Движение.ВКМ_ОтработаноДней;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьСторноЗаписи()
	
	СторноЗаписи = Движения.ВКМ_ОсновныеНачисления.ПолучитьДополнение();
	
	Для Каждого СтрокаСторно Из СторноЗаписи Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаСторно);
		
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = СтрокаСторно.ПериодДействияНачалоСторно;
		Движение.ПериодДействияКонец = СтрокаСторно.ПериодДействияКонецСторно;
		Движение.Сторно = Истина;
		
		Движение.ВКМ_Результат = -СтрокаСторно.ВКМ_Результат;
		Движение.ВКМ_ОтработаноДней = -СтрокаСторно.ВКМ_ОтработаноДней;
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьПремии()
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_ДополнительныеНачисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧ.Сотрудник КАК Сотрудник,
	|	ТЧ.ВидРасчета КАК ВидРасчета,
	|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот, 0) КАК БазаНачисления
	|ИЗ
	|	Документ.ВКМ_НачисленияЗарплаты.ДополнительныеНачисления КАК ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода,,) КАК
	|			ВКМ_ВыполненныеСотрудникомРаботыОбороты
	|		ПО ТЧ.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|	И ТЧ.ВидРасчета = &ВидРасчетаПремия";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	// ! ВАЖНО: Добавлен параметр ВидРасчетаПремия, которого не хватало
	Запрос.УстановитьПараметр("ВидРасчетаПремия", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник         = Выборка.Сотрудник;
		Движение.ВидРасчета        = Выборка.ВидРасчета;
		
		// ! ВАЖНО: Убрана ошибка. Теперь мы берем просто сумму базы, 
		// так как процент уже применился в документе Обслуживания
		Движение.Результат = Выборка.БазаНачисления;
		
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	
КонецПроцедуры

Процедура РассчитатьНДФЛ()
	
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_Удержания.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Сотрудник КАК Сотрудник,
	|	СУММА(Начисления.Результат) КАК Результат
	|ИЗ
	|	(ВЫБРАТЬ
	|		Осн.Сотрудник КАК Сотрудник,
	|		Осн.ВКМ_Результат КАК Результат
	|	ИЗ
	|		РегистрРасчета.ВКМ_ОсновныеНачисления КАК Осн
	|	ГДЕ
	|		Осн.Регистратор = &Ссылка
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Доп.Сотрудник,
	|		Доп.Результат
	|	ИЗ
	|		РегистрРасчета.ВКМ_ДополнительныеНачисления КАК Доп
	|	ГДЕ
	|		Доп.Регистратор = &Ссылка) КАК Начисления
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		
		// Убедитесь, что Вид расчета НДФЛ существует
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		
		// !!! ИСПРАВЛЕНИЕ ЗДЕСЬ !!!
		// Если в регистре ресурс называется "ВКМ_Результат"
		Движение.ВКМ_Результат = Выборка.Результат * 0.13;
		
		// Если ошибка останется, зайдите в Конфигуратор -> РегистрыРасчета -> ВКМ_Удержания -> Ресурсы
		// и посмотрите точное имя ресурса. Вставьте его после точки: Движение.ВашеИмяРесурса
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

#КонецОбласти