#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ВКМ_Начало
	// Вызываем управление видимостью при открытии, чтобы сразу скрыть/показать нужное
	ВКМ_УправлениеВидимостьюЭлементов();
	// ВКМ_Конец
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)
	
	// ВКМ_Начало
	// При изменении вида договора пользователем сразу меняем видимость
	ВКМ_УправлениеВидимостьюЭлементов();
	// ВКМ_Конец
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ВКМ_Начало
&НаСервере
Процедура ВКМ_УправлениеВидимостьюЭлементов()
	
	// Определяем, выбран ли наш новый вид договора
	ЭтоАбонентский = (Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	// Устанавливаем видимость. 
	
	Попытка
		Элементы.ВКМ_ДатаНачала.Видимость              = ЭтоАбонентский;
		Элементы.ВКМ_ДатаОкончания.Видимость           = ЭтоАбонентский;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость   = ЭтоАбонентский;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость     = ЭтоАбонентский;
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры
// ВКМ_Конец

#КонецОбласти