
Процедура ВыполнитьСозданиеАктов(Параметры, АдресРезультата) Экспорт
	
	ДанныеДляОбработки = Параметры.ДанныеДляОбработки; 
	Период             = Параметры.Период;
	
	СозданоДокументов = 0;
	МассивОшибок = Новый Массив;
	
	Для Каждого СтрокаДанных Из ДанныеДляОбработки Цикл
		
		Если ЗначениеЗаполнено(СтрокаДанных.Реализация) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			НовыйДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДок.Дата = КонецМесяца(Период); 
			НовыйДок.Контрагент = СтрокаДанных.Договор.Владелец; 
			НовыйДок.Договор    = СтрокаДанных.Договор;
			НовыйДок.Организация = СтрокаДанных.Договор.Организация;
			НовыйДок.Ответственный = Пользователи.ТекущийПользователь(); 
			НовыйДок.ВКМ_ВыполнитьАвтозаполнение();
			
			Если НовыйДок.Услуги.Количество() > 0 Тогда
				НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
				СозданоДокументов = СозданоДокументов + 1;
			КонецЕсли;
			
		Исключение
			МассивОшибок.Добавить("Ошибка по договору " + Строка(СтрокаДанных.Договор) + ": " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("СозданоДокументов", СозданоДокументов);
	Результат.Вставить("Ошибки", МассивОшибок);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры